task_types = {
    'task1': 'Задание 1: Безударные проверяемые и непроверяемые гласные в корне',
    'task2': 'Задание 2: Безударные проверяемые и непроверяемые гласные в корне',
    'task3': 'Задание 3: Безударные проверяемые и непроверяемые гласные в корне',
    'task4': 'Задание 4: Чередующиеся гласные в корнях слов',
    'task5': 'Задание 5: Чередующиеся гласные в корнях слов',
    'task6': 'Задание 6: Чередующиеся гласные в корнях слов',
    'task7': 'Задание 7: Правописание согласных в корне слова',
    'task8': 'Задание 8: Правописание согласных в корне слова',
    'task9': 'Задание 9: Правописание приставок, заканчивающихся на буквы З и С',
    'task10': 'Задание 10: Буквы Ы и И после Ц',
    'task11': 'Задание 11: Буквы О и Е (Ё) после шипящих и Ц',
    'task12': 'Задание 12: Буквы О и Е (Ё) после шипящих и Ц',
    'task13': 'Задание 13: Употребление прописных букв',
    'task14': 'Задание 14: Гласные в окончаниях слов',
    'task15': 'Задание 15: гласные в окончаниях слов',
    'task16': 'Задание 16: Гласные в окончаниях слов',
    'task17': 'Задание 17: Правописание Ь',
    'task18': 'Задание 18: Правописание Ь',
    'task19': 'Задание 19: Правописание Ь',
    'task20': 'Задание 20: Правописание Ь',
    'task21': 'Задание 21: Правописание Ь',
    'task22': 'Задание 22: Слитное и раздельное написание НЕ и НИ с различными частями речи',
    'task23': 'Задание 23: Буквы И, У, А после шипящих (Ж, Ш, Ч, Щ)',
    'task24': 'Задание 24: Раздельное написание предлогов с самостоятельными частями речи',
    'task25': 'Задание 25: Разделительные Ь и Ъ'
}


task1 = {
    'ст…ловая': ('о', ('а', 'о')),
    'в…ренье': ('а', ('а', 'о')),
    'пок…заться': ('а', ('а', 'о')),
    'ст…лбы': ('о', ('а', 'о')),
    'см…треть': ('о', ('а', 'о')),
    'к…рмилица': ('о', ('а', 'о')),
    'потр…сение': ('я', ('е', 'я')),
    'фант…зировать': ('а', ('а', 'о')),
    'зат…мно': ('е', ('и', 'е')),
    'зв…нить': ('о', ('а', 'о'))
}

task2 = {
    'аквар…ум': ('и', ('и', 'е')),
    'м…ршрут': ('а', ('а', 'о')),
    'справ…': ('а', ('а', 'о')),
    'св…бода': ('о', ('а', 'о')),
    'авт…мобиль': ('о', ('а', 'о')),
    'агр…ном': ('о', ('а', 'о')),
    'вправ…': ('о', ('а', 'о')),
    'в…зде': ('е', ('и', 'е')),
    'к…ртина': ('а', ('а', 'о')),
    'пи…нино': ('а', ('а', 'о'))
}

task3 = {
    'п…дчеркнуть': ('о', ('а', 'о')),
    'п…чувствовать': ('о', ('а', 'о')),
    'с…считать': ('о', ('а', 'о')),
    'н…писать': ('а', ('а', 'о')),
    'н…дстроить': ('а', ('а', 'о')),
    '…твязаться': ('о', ('а', 'о')),
    '…тгадать': ('о', ('а', 'о')),
    'д…бавить': ('о', ('а', 'о')),
    'пр…красться': ('о', ('а', 'о')),
    'п…средник': ('о', ('а', 'о'))
}

task4 = {
    'пол…гать': ('а', ('а', 'о')),
    'пол…жение': ('о', ('а', 'о')),
    'предл…гается': ('а', ('а', 'о')),
    'изл…жите': ('о', ('а', 'о')),
    'распол…гаются': ('а', ('а', 'о')),
    'обл…гается': ('а', ('а', 'о')),
    'сл…жить': ('о', ('а', 'о')),
    'пол…гают': ('а', ('а', 'о')),
    'предпол…жить': ('о', ('а', 'о')),
    'зал…жить': ('о', ('а', 'о'))
}

task5 = {
    'р…сти': ('а', ('а', 'о')),
    'пор…сль': ('о', ('а', 'о')),
    'водор…сли': ('о', ('а', 'о')),
    'подр…стать': ('а', ('а', 'о')),
    'повзр…слеть': ('о', ('а', 'о')),
    'р…стительный': ('а', ('а', 'о')),
    'ср…щение': ('а', ('а', 'о')),
    'ср…слись': ('о', ('а', 'о')),
    'разр…стаются': ('а', ('а', 'о')),
    'подр…сли': ('о', ('а', 'о'))
}

task6 = {
    'перет…реть': ('е', ('и', 'е')),
    'изб…рать': ('и', ('и', 'е')),
    'обт…реть': ('е', ('и', 'е')),
    'отд…рать': ('и', ('и', 'е')),
    'пот…реть': ('е', ('и', 'е')),
    'сд…рать': ('и', ('и', 'е')),
    'ст…реть': ('е', ('и', 'е')),
    'продв…гаться': ('и', ('и', 'е')),
    'бл…стает': ('и', ('и', 'е')),
    'выт…рается': ('и', ('и', 'е')),
}

task7 = {
    'тру…ка': ('б', ('п', 'б')),
    'ло…ка': ('д', ('т', 'д')),
    'выши…ка': ('в', ('ф', 'в')),
    'ладо…ка': ('ш', ('ш', 'ж')),
    'коро…ка': ('б', ('п', 'б')),
    'го…': ('д', ('т', 'д')),
    'гла…кий': ('д', ('т', 'д')),
    'дер…кий': ('з', ('с', 'з')),
    'лё…кий': ('г', ('х', 'г')),
    'жу…кий': ('т', ('т', 'д'))
}

task8 = {
    'ус…ный': ('т', ('т', 'ничего')),
    'прекрас…ный': ('ничего', ('т', 'ничего')),
    'телес…ный': ('ничего', ('т', 'ничего')),
    'гиган…ский': ('т', ('т', 'ничего')),
    'неумес…ный': ('т', ('т', 'ничего')),
    'безжалос…ный': ('т', ('т', 'ничего')),
    'хрус…нуть': ('т', ('т', 'ничего')),
    'проез…ной': ('д', ('д', 'ничего')),
    'лес…ница': ('т', ('т', 'ничего')),
    'здра…ствуйте': ('в', ('в', 'ничего'))
}

task9 = {
    'и…пить': ('с', ('с', 'з')),
    'ра…кусить': ('с', ('с', 'з')),
    'ра…путать': ('с', ('с', 'з')),
    'бе…системный': ('с', ('с', 'з')),
    'ра…писной': ('с', ('с', 'з')),
    'ра…шуметься': ('с', ('с', 'з')),
    'и…вергать': ('з', ('с', 'з')),
    'бе…смертный': ('с', ('с', 'з')),
    'ра…шевелить': ('с', ('с', 'з')),
    'ра…ширить': ('с', ('с', 'з'))
}

task10 = {
    'на ц…почках': ('ы', ('ы', 'и')),
    'синиц…': ('ы', ('ы', 'и')),
    'ц…ферблат': ('и', ('ы', 'и')),
    'конституц…я': ('и', ('ы', 'и')),
    'ц…трус': ('и', ('ы', 'и')),
    'провокац…я': ('и', ('ы', 'и')),
    'нумерац…я': ('и', ('ы', 'и')),
    'ц…пленок': ('ы', ('ы', 'и')),
    'ц…линдр': ('и', ('ы', 'и')),
    'ц…клон': ('и', ('ы', 'и'))
}

task11 = {
    'переч…ркивать': ('ё', ('о', 'ё')),
    'щ…чка': ('ё', ('о', 'ё')),
    'ч…тный': ('ё', ('о', 'ё')),
    'щ…лкнуть': ('ё', ('о', 'ё')),
    'зач…сывать': ('ё', ('о', 'ё')),
    'прич…ска': ('ё', ('о', 'ё')),
    'ш…рох': ('о', ('о', 'ё')),
    'ч…рный': ('ё', ('о', 'ё')),
    'ч…рствый': ('ё', ('о', 'ё')),
    'ч…рт': ('ё', ('о', 'ё'))
}

task12 = {
    'карандаш…м': ('о', ('о', 'ё')),
    'столиц…й': ('е', ('о', 'е')),
    'кулич…м': ('о', ('о', 'ё')),
    'птиц…й': ('е', ('о', 'е')),
    'крыш…й': ('е', ('о', 'е')),
    'братц…м': ('е', ('о', 'е')),
    'полотенц…м': ('е', ('о', 'е')),
    'китайц…м': ('е', ('о', 'е')),
    'ключ…м': ('о', ('о', 'ё')),
    'ковш…м': ('о', ('о', 'ё'))
}

task13 = {
    '…ихаил Зощенко': ('М', ('м', 'М')),
    'рассказ «…стреча»': ('р', ('р', 'Р')),
    'город …верь': ('Т', ('т', 'Т')),
    'река …непр': ('Д', ('д', 'Д')),
    'Дмитрий …ванович': ('И', ('и', 'И')),
    '…встралия': ('А', ('а', 'А')),
    '…ихий океан': ('Т', ('т', 'Т')),
    'балет «…изель»': ('Ж', ('ж', 'Ж')),
    'журнал «…остёр»': ('К', ('к', 'К')),
    '…асилиса Прекрасная': ('В', ('в', 'В'))
}

task14 = {
    'на окраин…': ('е', ('е', 'и')),
    'в санатори…': ('и', ('е', 'и')),
    'на опушк…': ('е', ('е', 'и')),
    'в секци…': ('и', ('е', 'и')),
    'в ракет…': ('е', ('е', 'и')),
    'о преми…': ('и', ('е', 'и')),
    'на полян…': ('е', ('е', 'и')),
    'в окрестност…': ('и', ('е', 'и')),
    'на веранд…': ('е', ('е', 'и')),
    'в киоск…': ('е', ('е', 'и'))
}

task15 = {
    'в морозн…й': ('о', ('о', 'а')),
    'за младш…ю': ('у', ('у', 'ю')),
    'в шерстян…м': ('о', ('о', 'а')),
    'над пшеничн…м': ('ы', ('о', 'ы')),
    'в обратн…м': ('о', ('о', 'ы')),
    'об интересн…й': ('о', ('о', 'а')),
    'о страшн…м': ('о', ('о', 'а')),
    'о далёк…м': ('о', ('о', 'а')),
    'с хорош…м': ('и', ('и', 'ы')),
    'на красив…м': ('о', ('о', 'а'))
}

task16 = {
    'улыба…тся': ('е', ('е', 'и')),
    'выгоня…т': ('е', ('е', 'и')),
    'допуска…т': ('е', ('е', 'и')),
    'углубля…т': ('е', ('е', 'и')),
    'пропилива…т': ('е', ('е', 'и')),
    'увид…м': ('и', ('е', 'и')),
    'завис…т': ('и', ('е', 'и')),
    'сгоня…т': ('е', ('е', 'и')),
    'терп…т': ('и', ('е', 'и')),
    'прогон…т': ('и', ('е', 'и'))
}

task17 = {
    'строч…ка': ('ничего', ('ь', 'ничего')),  # (9)
    'нян…чить': ('ничего', ('ь', 'ничего')),
    'проч…ти': ('ничего', ('ь', 'ничего')),
    'опасност…': ('ь', ('ь', 'ничего')),
    'поднес…ти': ('ничего', ('ь', 'ничего')),
    'сроч…ный': ('ничего', ('ь', 'ничего')),
    'доблест…': ('ь', ('ь', 'ничего')),
    'сестрич…ка': ('ничего', ('ь', 'ничего')),
    'хвос…тик': ('ничего', ('ь', 'ничего'))
}

task18 = {
    'тиш…': ('ь', ('ь', 'ничего')),
    'мяч…': ('ничего', ('ь', 'ничего')),
    'Воронеж…': ('ничего', ('ь', 'ничего')),
    'гореч…': ('ь', ('ь', 'ничего')),
    'вещ…': ('ь', ('ь', 'ничего')),
    'с круч…': ('ничего', ('ь', 'ничего')),
    'Керч…': ('ь', ('ь', 'ничего')),
    'сторож…': ('ничего', ('ь', 'ничего')),
    'грач…': ('ничего', ('ь', 'ничего')),
    'плащ…': ('ничего', ('ь', 'ничего'))
}

task19 = {
    'везуч…': ('ничего', ('ь', 'ничего')),  # (9)
    'липуч…': ('ничего', ('ь', 'ничего')),
    'всеведущ…': ('ничего', ('ь', 'ничего')),
    'трескуч…': ('ничего', ('ь', 'ничего')),
    'шипуч…': ('ничего', ('ь', 'ничего')),
    'пригож…': ('ничего', ('ь', 'ничего')),
    'сведущ…': ('ничего', ('ь', 'ничего')),
    'зряч…': ('ничего', ('ь', 'ничего')),
    'дремуч…': ('ничего', ('ь', 'ничего'))
}

task20 = {
    'отвлеч…': ('ь', ('ь', 'ничего')),
    'шепчеш…ся': ('ь', ('ь', 'ничего')),
    'увлеч…': ('ь', ('ь', 'ничего')),
    'привлекаеш…': ('ь', ('ь', 'ничего')),
    'забываеш…ся': ('ь', ('ь', 'ничего')),
    'жеч…ся': ('ь', ('ь', 'ничего')),
    'заболееш…': ('ь', ('ь', 'ничего')),
    'подстереч…': ('ь', ('ь', 'ничего')),
    'захохочеш…': ('ь', ('ь', 'ничего')),
    'подстрич…': ('ь', ('ь', 'ничего'))
}

task21 = {
    'сомневат…ся': ('ь', ('ь', 'ничего')),
    'нагревает…ся': ('ничего', ('ь', 'ничего')),
    'угнетают…ся': ('ничего', ('ь', 'ничего')),
    'промчат…ся': ('ь', ('ь', 'ничего')),
    'разрастат…ся': ('ь', ('ь', 'ничего')),
    'обжигает…ся': ('ничего', ('ь', 'ничего')),
    'отстёгивает…ся': ('ничего', ('ь', 'ничего')),
    'обвенчат…ся': ('ь', ('ь', 'ничего')),
    'топчет…ся': ('ничего', ('ь', 'ничего')),
    'борот…ся': ('ь', ('ь', 'ничего'))
}

task22 = {
    '(не) зарастёт': ('раздельно', ('слитно', 'раздельно')),
    '(не) предполагаешь': ('раздельно', ('слитно', 'раздельно')),
    '(не) годовать': ('слитно', ('слитно', 'раздельно')),
    '(не) возьмёшь': ('раздельно', ('слитно', 'раздельно')),
    '(не) выдернет': ('раздельно', ('слитно', 'раздельно')),
    '(не) доумевать': ('слитно', ('слитно', 'раздельно')),
    '(не) домогает': ('слитно', ('слитно', 'раздельно')),
    '(не) долюбливает': ('слитно', ('слитно', 'раздельно')),
    '(не) заставит': ('раздельно', ('слитно', 'раздельно')),
    '(не) доедает': ('слитно', ('слитно', 'раздельно'))
}

task23 = {
    'ч…ткий': ('у', ('у', 'ю')),  # (9)
    'ш…рокий': ('и', ('и', 'ы')),
    'ч…ть-ч…ть': ('у', ('у', 'ю')),
    'зайч…та': ('а', ('а', 'я')),
    'уж…н': ('и', ('и', 'ы')),
    'ч…йка': ('а', ('а', 'я')),
    'ж…рный': ('и', ('и', 'ы')),
    'звуч…ть': ('а', ('а', 'я')),
    'уш…': ('и', ('и', 'ы'))
}

task24 = {
    '(с) дороги': ('раздельно', ('слитно', 'раздельно')),
    '(из-под) вяза': ('раздельно', ('слитно', 'раздельно')),
    '(над) деревней': ('раздельно', ('слитно', 'раздельно')),
    '(до) поворота': ('раздельно', ('слитно', 'раздельно')),
    '(по) праву': ('раздельно', ('слитно', 'раздельно')),
    '(в) труде': ('раздельно', ('слитно', 'раздельно')),
    '(на) лету': ('раздельно', ('слитно', 'раздельно')),
    '(по) стране': ('раздельно', ('слитно', 'раздельно')),
    '(на) глубине': ('раздельно', ('слитно', 'раздельно')),
    '(в) стороне': ('раздельно', ('слитно', 'раздельно'))
}

task25 = {
    'заяч…я': ('ь', ('ь', 'ъ', 'ничего')),
    'колос…я': ('ь', ('ь', 'ъ', 'ничего')),
    'соб…ют': ('ь', ('ь', 'ъ', 'ничего')),
    'птич…и': ('ь', ('ь', 'ъ', 'ничего')),
    'пред…юбилейный': ('ъ', ('ь', 'ъ', 'ничего')),
    'об…ект': ('ъ', ('ь', 'ъ', 'ничего')),
    'с…экономил': ('ничего', ('ь', 'ъ', 'ничего')),
    'от…езд': ('ъ', ('ь', 'ъ', 'ничего')),
    'бар…ер': ('ь', ('ь', 'ъ', 'ничего')),
    'без…аварийный': ('ничего', ('ь', 'ъ', 'ничего'))
}
